app/views/carts/index.html.erb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
---
<% @cart.each do |product_id| %>
  <% p = Product.find(product_id) %>