app/controllers/orders_controller.rb

INSERT INTO "orders" ("street", "city", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["street", "425 some street"], ["city", "DC"], ["state", "Washington"], ["zip", "3832"], ["created_at", "2019-03-25 22:00:59.735067"], ["updated_at", "2019-03-25 22:00:59.735067"]]
---
   def create
     @order = Order.create(order_params)