app/views/categories/show.html.erb

<div class="list-group">
  <% @category.products.each do |c| %>
---
SELECT "products".* FROM "products" INNER JOIN "category_products" ON "products"."id" = "category_products"."product_id" WHERE "category_products"."category_id" = $1  [["category_id", 1]]